Changes to BCDR docs
committing minor changes to bcdr
